backend/app/models/user.rb

INSERT INTO "users" ("email", "name", "google_id", "avatar_url", "created_at", "updated_at") VALUES ('j.kaneko.tech@gmail.com', '金子純樹', '101321913305372993002', 'https://lh3.googleusercontent.com/a/ACg8ocJ1QTMxa2CmzLArtrjQukmN8f7t6R4vXh1jqVRZxUSYsc7dJA=s50-c', '2025-06-01 14:18:43.425272', '2025-06-01 14:18:43.425272') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."google_id" = '101321913305372993002' ORDER BY "users"."id" ASC LIMIT 1
---
  def self.from_omniauth(auth)
    where(google_id: auth.uid).first_or_create do |user|