backend/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header

    begin
      decoded = JWT.decode(header, Rails.application.secret_key_base)[0]
      @current_user = User.find(decoded['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1